log_local_25rq_20G.txt
Namespace(backend='vllm', base_url='https://vllmtest3.service-inference.ai', host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='./ShareGPT_V3_unfiltered_cleaned_split.json', model='deepseek-ai/DeepSeek-R1-Distill-Llama-8B', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=20480, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=2048, random_output_len=128, random_range_ratio=1.0, request_rate=2.5, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 2.5
2025-02-15 17:31:51 ERROR on: https://vllmtest3.service-inference.ai/v1/completions Bad Gateway
============ Serving Benchmark Result ============
Successful requests:                     9594      
Benchmark duration (s):                  8243.93   
Total input tokens:                      1543336   
Total generated tokens:                  2020634   
Request throughput (req/s):              1.16      
Input token throughput (tok/s):          187.21    
Output token throughput (tok/s):         245.11    
---------------Time to First Token----------------
Mean TTFT (ms):                          46138.08  
Median TTFT (ms):                        48607.34  
P99 TTFT (ms):                           50049.24  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          116.82    
Median TPOT (ms):                        98.62     
P99 TPOT (ms):                           464.76    
---------------Inter-token Latency----------------
Mean ITL (ms):                           100.09    
Median ITL (ms):                         93.49     
P99 ITL (ms):                            394.59    
==================================================