log_local_2rq_20G.txt
Namespace(backend='vllm', base_url='https://vllmtest1.service-inference.ai', host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='./ShareGPT_V3_unfiltered_cleaned_split.json', model='deepseek-ai/DeepSeek-R1-Distill-Llama-8B', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=10240, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=2048, random_output_len=128, random_range_ratio=1.0, request_rate=2.0, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 2.0
============ Serving Benchmark Result ============
Successful requests:                     5762      
Benchmark duration (s):                  5171.69   
Total input tokens:                      1004813   
Total generated tokens:                  1211537   
Request throughput (req/s):              1.11      
Input token throughput (tok/s):          194.29    
Output token throughput (tok/s):         234.26    
---------------Time to First Token----------------
Mean TTFT (ms):                          45122.23  
Median TTFT (ms):                        47998.65  
P99 TTFT (ms):                           50040.99  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          115.75    
Median TPOT (ms):                        98.25     
P99 TPOT (ms):                           465.79    
---------------Inter-token Latency----------------
Mean ITL (ms):                           100.31    
Median ITL (ms):                         93.71     
P99 ITL (ms):                            401.53    
==================================================