log_local_4rq_20G.txt
Namespace(backend='vllm', base_url='https://vllmtest3.service-inference.ai', host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='./ShareGPT_V3_unfiltered_cleaned_split.json', model='deepseek-ai/DeepSeek-R1-Distill-Llama-8B', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=20480, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, request_rate=4.0, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 4.0
2025-02-14 07:28:08 ERROR on: https://vllmtest3.service-inference.ai/v1/completions Bad Gateway
============ Serving Benchmark Result ============
Successful requests:                     6155      
Benchmark duration (s):                  5201.54   
Total input tokens:                      803041    
Total generated tokens:                  1325592   
Request throughput (req/s):              1.18      
Input token throughput (tok/s):          154.39    
Output token throughput (tok/s):         254.85    
---------------Time to First Token----------------
Mean TTFT (ms):                          47377.00  
Median TTFT (ms):                        49503.00  
P99 TTFT (ms):                           50133.55  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          124.31    
Median TPOT (ms):                        104.33    
P99 TPOT (ms):                           535.21    
---------------Inter-token Latency----------------
Mean ITL (ms):                           106.43    
Median ITL (ms):                         95.14     
P99 ITL (ms):                            404.98    
==================================================