log_local_75rq_local.txt
Namespace(backend='vllm', base_url='https://vllmtest1.service-inference.ai', host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='./ShareGPT_V3_unfiltered_cleaned_split.json', model='deepseek-ai/DeepSeek-R1-Distill-Llama-8B', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=20480, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=2048, random_output_len=128, random_range_ratio=1.0, request_rate=7.5, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 7.5
2025-02-16 01:45:40 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 01:57:45 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 01:59:21 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 01:59:35 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 01:59:38 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:00:01 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:01:07 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:02:17 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:02:22 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:02:44 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:03:22 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:03:37 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:03:40 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:04:49 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:04:57 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:05:20 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:05:26 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:07:48 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:07:48 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:10:30 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:13:15 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:16:49 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:16:53 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:17:26 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:19:09 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:19:18 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:20:15 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:20:34 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:22:16 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:23:28 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:23:43 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:26:23 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:27:06 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:27:07 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
2025-02-16 02:28:45 ERROR on: https://vllmtest1.service-inference.ai/v1/completions Bad Gateway
============ Serving Benchmark Result ============
Successful requests:                     16526     
Benchmark duration (s):                  2889.81   
Total input tokens:                      3630307   
Total generated tokens:                  3219164   
Request throughput (req/s):              5.72      
Input token throughput (tok/s):          1256.25   
Output token throughput (tok/s):         1113.97   
---------------Time to First Token----------------
Mean TTFT (ms):                          12641.64  
Median TTFT (ms):                        3576.97   
P99 TTFT (ms):                           50857.52  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          700.98    
Median TPOT (ms):                        934.49    
P99 TPOT (ms):                           1229.32   
---------------Inter-token Latency----------------
Mean ITL (ms):                           671.14    
Median ITL (ms):                         554.48    
P99 ITL (ms):                            1163.12   
==================================================